In [12]:
import pandas as pd

# SQL Alchemy
from sqlalchemy import create_engine
from sqlalchemy import create_engine, inspect

#Create a connection to the Employees database
engine = create_engine('postgresql://postgres:postgres@localhost/university_db')
conn = engine.connect()

In [13]:
#Inspect engine
inspector = inspect(engine)

In [14]:
#Get all table names
inspector.get_table_names()

['year_2_tuition', 'year_4_tuition']

In [26]:

year_4_tuition_df = pd.read_csv("Resources/year_4_tuition.csv")
year_4_tuition_df.head()

   year_4_id  start_year  end_year  public_tuition\n  private_tuition\n
0          1        2009      2010             15036              31847
1          2        2010      2011             15919              32517
2          3        2011      2012             16787              33677
3          4        2012      2013             17475              35071
4          5        2013      2014             18100              36599

In [27]:
year_4_tuition_df.to_sql(name='year_4_tuition', con=engine, if_exists='append', index=False)

In [29]:
 pd.read_sql_query('select * from year_4_tuition', con=engine).head()

   year_4_id  start_year  end_year  public_tuition  private_tuition
0          1        2009      2010           15036            31847
1          2        2010      2011           15919            32517
2          3        2011      2012           16787            33677
3          4        2012      2013           17475            35071
4          5        2013      2014           18100            36599

In [30]:
year_2_tuition_df = pd.read_csv("Resources/year_2_tuition.csv")
year_2_tuition_df.head()

   year_2_id  start_year  end_year  public_tuition\n  private_tuition\n
0          1        2009      2010              7708              24463
1          2        2010      2011              8079              23101
2          3        2011      2012              8617              23605
3          4        2012      2013              8927              23355
4          5        2013      2014              9283              23870

In [32]:
year_2_tuition_df.to_sql(name='year_2_tuition', con=engine, if_exists='append', index=False)

In [33]:
 pd.read_sql_query('select * from year_2_tuition', con=engine).head()

   year_2_id  start_year  end_year  public_tuition  private_tuition
0          1        2009      2010            7708            24463
1          2        2010      2011            8079            23101
2          3        2011      2012            8617            23605
3          4        2012      2013            8927            23355
4          5        2013      2014            9283            23870